hpmicro/hpm_sdk/soc/HPM5300/HPM53M1/HPM53M1_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="PWM0">
      <name>PWM1</name>
      <description>PWM1</description>
      <groupName>PWM</groupName>
      <baseAddress>0xf031c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>RDC</name>
      <description>RDC</description>
      <groupName>RDC</groupName>
      <baseAddress>0xf0320000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xf0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>rdc_ctl</name>
          <description>rdc control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FF077</resetMask>
          <fields>
            <field>
              <name>TS_SEL</name>
              <description>Time stamp selection for accumulation
0: end of accumulation
1: start of accumulation
2: center of accumulation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_LEN</name>
              <description>Accumulate time, support on the fly change
0：1 cycle
1：2 cycles
…
255: 256 cycles</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECTIFY_SEL</name>
              <description>Select reference point of rectify signal
0: 0 phase of internal exciting signal
1: 90 phase of internal exciting signal
2: 180 phase of internal exciting signal
3: 270 phase of internal exciting signal
4: use value on external pin
5: use  invert value on external pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_EN</name>
              <description>Enable rdc accumulate
0: rdc disable
1: rdc enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXC_START</name>
              <description>Write 1 start excite signal, always read 0
0: no effect
1: start excite signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXC_EN</name>
              <description>Enable rdc excite signal
0: rdc disable
1: rdc enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>acc_i</name>
          <description>accumulate result of i_channel</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACC</name>
              <description>accumulate result of i_channel, this is a signed number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>acc_q</name>
          <description>accumulate result of q_channel</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACC</name>
              <description>accumulate result of q_channel, this is a signed number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>in_ctl</name>
          <description>input channel selection</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0011F11F</resetMask>
          <fields>
            <field>
              <name>PORT_Q_SEL</name>
              <description>Input port selection for q_channel,
0:sel port0
1:sel port1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_Q_SEL</name>
              <description>Input channel selection for q_channel
0: channel 0 selected
1: channel 1 selected
…
31: channel 31 selected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_I_SEL</name>
              <description>Input port selection for i_channel,
0:sel port0
1:sel port1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_I_SEL</name>
              <description>Input channel selection for i_channel
0: channel 0 selected
1: channel 1 selected
…
31: channel 31 selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>out_ctl</name>
          <description>output channel selection</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F1F</resetMask>
          <fields>
            <field>
              <name>CH_Q_SEL</name>
              <description>Output channel selection for q_channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_I_SEL</name>
              <description>Output channel selection for i_channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>exc_timming</name>
          <description>excitation signal timming setting</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x000400C8</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>SWAP</name>
              <description>Swap output of PWM and DAC
0: disable swap
1: swap output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_PRD</name>
              <description>Pwm period in samples，
0：1 sample period
1:   2 sample period
...
15: 16 sample period</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_NUM</name>
              <description>Number of sample every excitation period
0: 4 point
1: 8 point
…
8: 1024 point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_RATE</name>
              <description>The period for excitation sample in clock cycle，
0: not allowed
1: 1 cycle
2: 2 cycles
…
65535 : 65535 cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>exc_scaling</name>
          <description>amplitude scaling for excitation</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000011</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>AMP_EXP</name>
              <description>Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_MAN</name>
              <description>Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>exc_offset</name>
          <description>amplitude offset setting</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00800000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>AMP_OFFSET</name>
              <description>Offset for excitation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pwm_scaling</name>
          <description>amplitude scaling for excitation</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000111</resetValue>
          <resetMask>0x000031FF</resetMask>
          <fields>
            <field>
              <name>N_POL</name>
              <description>Polarity of exc_n signal
0: high active
1: low active</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P_POL</name>
              <description>Polarity of exc_p signal
0: high active
1: low active</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DITHER</name>
              <description>Enable dither of pwm
0: disable
1: enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_EXP</name>
              <description>Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_MAN</name>
              <description>Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pwm_offset</name>
          <description>amplitude offset setting</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000064</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>AMP_OFFSET</name>
              <description>Offset for excitation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>trig_out0_cfg</name>
          <description>Configuration for trigger out 0 in clock cycle</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00100019</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable trigger out0
0: disable
1: enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEAD_TIM</name>
              <description>Lead time for trigger out0 from center of low level , this is a signed value
…
2: 2 cycle befor center of low level
1: 1 cycle before center of low level
0: center of low level
-1: 1cycle after center of low level
-2: 2cycle after center of low level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>trig_out1_cfg</name>
          <description>Configuration for trigger out 1 in clock cycle</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x0010004B</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable trigger out1
0: disable
1: enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEAD_TIM</name>
              <description>Lead time for trigger out0 from center of hight level , this is a signed value
…
2: 2 cycle befor center of hight level
1: 1 cycle before center of hight level
0: center of hight level
-1: 1cycle after center of hight level
-2: 2cycle after center of hight level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pwm_dz</name>
          <description>pwm dead zone control in clock cycle</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DZ_N</name>
              <description>Exc_n dead zone  in clock cycle before swap
0: no dead zone
1: 1 cycle dead zone
2: 2 cycle dead zone
…</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DZ_P</name>
              <description>Exc_p dead zone  in clock cycle before swap
0: no dead zone
1: 1 cycle dead zone
2: 2 cycle dead zone
…</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sync_out_ctrl</name>
          <description>synchronize output signal control</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0033</resetMask>
          <fields>
            <field>
              <name>PWM_OUT_DLY</name>
              <description>Delay bettween the delyed trigger and the first pwm pulse in clock cycle
1: 1 cycle
2: 2 cycle
…</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN2TRIG_EN</name>
              <description>Enable trigger out from the min point of exciting signal
1: enable
0: disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX2TRIG_EN</name>
              <description>Enable trigger out from the max point of exciting signal
1: enable
0: disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_OUT_SEL</name>
              <description>Select output synchornize signal
0: 0 phase of internal exciting signal
1: 90 phase of internal exciting signal
2: 180 phase of internal exciting signal
3: 270 phase of internal exciting signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>exc_sync_dly</name>
          <description>trigger in delay timming in soc bus cycle</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x01000001</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Disable hardware trigger input
0: enable
1: disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY</name>
              <description>Trigger in delay timming in bus cycle from rising edge of trigger signal
0:   1 cycle
1:  2 cycle
…
0xffffff:  2^24 cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>max_i</name>
          <description>max value of  i_channel</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>MAX</name>
              <description>Max value of  i_channel, write clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Max value valid, write clear
0: max value is not valid
1: max value is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>min_i</name>
          <description>min value of  i_channel</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>MIN</name>
              <description>Min value of  i_channel, write clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Min value valid, write clear
0: min value is not valid
1: min value is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>max_q</name>
          <description>max value of  q_channel</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>MAX</name>
              <description>Max value of  q_channel, write clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Max value valid, write clear
0: max value is not valid
1: max value is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>min_q</name>
          <description>min value of  q_channel</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF01</resetMask>
          <fields>
            <field>
              <name>MIN</name>
              <description>Min value of  q_channel, write clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Min value valid, write clear
0: min value is not valid
1: min value is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>thrs_i</name>
          <description>the offset setting for edge detection of the i_channel</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>THRS</name>
              <description>The offset setting for edge detection of the i_channel, signed number
…
2: the offset is 0x800000+2
1: the offset is 0x800000+1
0: the offset is 0x800000
-1: the offset is 0x800000-1
-2: the offset is 0x800000-2
…</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>thrs_q</name>
          <description>the offset setting for edge detection of the q_channel</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>THRS</name>
              <description>The offset setting for edge detection of the q_channel, signed number
…
2: the offset is 0x800000+2
1: the offset is 0x800000+1
0: the offset is 0x800000
-1: the offset is 0x800000-1
-2: the offset is 0x800000-2
…</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
